[{
        "name": "iphone12",
        "title": "SIM Free iPhone 12 Pro Max 512GB 5G Mobile Phone - Graphite",
        "rating": 5,
        "reviews": 11,
        "imagePath": "./img/cart-iphone12pro-graphite.png",
        "price": 35.99,
        "category": "iPhone",
        "quantity": 1,
        "colours": ["blue", "graphite", "gold", "silver"],
        "about": "<p>iPhone 12 Pro Max. Superfast 5G. A14 Bionic, the fastest chip in a smartphone. Pro camera system for unbelievable low-light photography. And a larger Super Retina XDR display. It's a huge leap forward. </p> <p>Beautifully bright 6.7-inch Super Retina XDR display with ceramic shield with 4x better drop performance.</p> <p>Incredible low-light photography with the best Pro camera system on an iPhone, and 5x optical zoom range. Cinema-grade Dolby Vision video recording, editing and playback.</p> <p>Night mode portraits and next-level AR experiences with the LiDAR scanner and new MagSafe accessories for easy attach and faster wireless charging.</p>",
        "click": 1
    },
    {
        "name": "samsungs20",
        "title": "SIM Free Samsung Galaxy S20+ 5G 128GB Mobile Phone - Black",
        "rating": 5,
        "reviews": 15,
        "imagePath": "./img/cart-samsungS20-black.png",
        "price": 22.99,
        "category": "Samsung",
        "quantity": 1,
        "colours": ["black", "grey"],
        "about": "<p>Turn into a pro with the Samsung Galaxy S20+ Ultra 5G smartphone. Enjoy a stunning 12MP wide camera, a 10 MP front camera and a 64MP telephoto camera. Always take the perfect snap thanks to the huge 30x Space Zoom. Then switch from stills to Hollywood-ready movies that boast 8K resolution and a 24 FPS rate. And with the Pro Video Mode and Super Steady 2.0, you can create smoother videos than ever. Capture every detail and explore true emotion.</p> <p>Experience every moment in full, edge-to-edge clarity. And with a smaller punch-hole opening, let nothing get in your way.</p> <p>Be ready for the future. Speed into tomorrow with full 5G connectivity so you can stream and download lag-free.</p> <p>Everything is a tap away. Buy your morning coffee by using your phone to make contactless payments. And when you need to top up the battery you don't need to plug in a wire with wireless charging.</p>",
        "click": 2
    },
    {
        "name": "applewatchs5",
        "title": "Apple Watch S5 Cellular 44mm Space Grey Alu/ Black Band",
        "rating": 4,
        "reviews": 5,
        "imagePath": "./img/cart-applewatchS5-black.png",
        "price": 16.99,
        "category": "Apple Watch",
        "quantity": 1,
        "colours": ["white", "black", "pink"],
        "about": "<p>Apple Watch Series 5 has a display that's always on, showing the time and important information — no need to raise your wrist. It helps you navigate with the built-in compass. Enables international emergency calling. Let's you check on your heart with the ECG app. Tracks your workouts and activity. And has cellular built in, so you can stay connected with just your watch. 44mm fits 140 - 220 mm wrists.</p> <p>Plenty of new apps to help motivate you to stay healthy and active, while the Activity Ring tracks your progress. The Noise app alerts you to when the decibels in the area can damage your hearing. Log your menstruation information with the new Cycle app, or keep an eye on your heart with the new ECG app.</p> <p>Listen to around 50 million songs through the Apple Music library or add new apps by accessing the App Store. And with built in Apple Pay, you can instantly and securely get your morning coffee or midday snack.</p>",
        "click": 3
    },
    {
        "name": "samsungwatch",
        "title": "Samsung Galaxy 46mm Smart Watch - Silver",
        "rating": 4,
        "reviews": 8,
        "imagePath": "./img/cart-samsungsmartwatch.png",
        "price": 9.99,
        "category": "Smart Watch",
        "quantity": 1,
        "colours": [],
        "about": "<p>Stay connected, for longer, wherever you are. The Galaxy Watch boasts up to 7 days' battery life, so you're free to take calls and messages on the go. Pay for your morning coffee using Samsung Pay with a tap of the wrist and order an Uber using the built-in GPS. And you can do it all with your favourite Spotify playlists ready to listen to – just connect your wireless headphones and you're good to go.</p> <p>The Galaxy Watch can track up to 40 different exercises, allowing you to make the most of your workout. Move from hitting the gym to the park and to the pool and it'll help you achieve your goals.</p> <p>With Galaxy Watch, your music travels with you wherever you go. Do it all with your favourite Spotify playlists ready to listen to* – just connect your wireless headphones** and you're good to go. *Pre-installation of Spotify app and Spotify Premium subscription required.</p> <p>Track your heart rate while out for a run, following your route using the built-in GPS, and manage your health stats, nutritional goals and the calories you're burning. And of course it syncs seamlessly to Samsung Health across all your devices.</p>"
    },
    {
        "name": "macbookpro",
        "title": "Apple MacBook Pro 2020 13in i5 16GB 512GB - Space Grey",
        "rating": 5,
        "reviews": 18,
        "imagePath": "./img/cart-applemacbookpro2020.png",
        "price": 42.99,
        "category": "MacBook",
        "quantity": 1,
        "colours": [],
        "about": "<p>MacBook Pro features a quad-core Intel processor for up to 90 per cent faster performance. A brilliant and colourful Retina display with True Tone technology for a more comfortable viewing experience. A backlit Magic Keyboard and Touch ID. And dynamic, contextual controls with the Touch Bar. So you can take productivity to the next level.</p> <p>The 13-inch MacBook Pro is ready to take on even the toughest tasks. So when you're powering through prolevel processing jobs like compiling code, layering multiple tracks in a music composition or encoding video, you'll get everything done faster. And for the first time, you can configure 32GB of memory on a 13-inch MacBook Pro — for up to 50 per cent faster performance.</p> <p>The 13-inch MacBook Pro includes a solid-state drive that's incredibly fast, with sequential read speeds up to 3.0GB/s.10 The standard configurations have twice the capacity of the previous generation (256GB, 512GB or 1TB), and with up to 4TB of storage, you can take all your photos and videos with you no matter where you go. And with the Apple T2 Security Chip, everything is automatically encrypted on the fly.</p>",
        "click": 4
    },
    {
        "name": "ipadpro",
        "title": "Apple iPad Pro 2020 12.9 Inch Wi-Fi 128GB - Silver",
        "rating": 5,
        "reviews": 14,
        "imagePath": "./img/cart-appleiPadpro2020-silver.png",
        "price": 19.99,
        "category": "iPad",
        "quantity": 1,
        "colours": ["space_grey", "silver"],
        "about": "<p>Your next computer is not a computer. It's a magical piece of glass. It's so fast most PC laptops can't keep up. It has pro cameras that can transform reality. And you can use it with touch, pencil, keyboard, and now trackpad. It's the new iPad Pro.</p> <p>Advanced cameras combined with a large display, fast performance and highly calibrated sensors have always made iPad uniquely capable. The Wide and new Ultra Wide cameras help you frame the perfect photo or video. And together with studioquality mics and four-speaker audio, you can even set up a multicamera filmmaking rig.</p>",
        "click": 5
    },
    {
        "name": "smarttv4k",
        "title": "Samsung 65 Inch QE65Q70TATXXU Smart 4K UHD QLED TV",
        "rating": 4,
        "reviews": 7,
        "imagePath": "./img/cart-samsungsmart4Ktv.png",
        "price": 32.99,
        "category": "TV",
        "quantity": 1,
        "colours": [],
        "about": "<p>Experience incredible Quantum HDR powered by HDR10+ as the film makers intended. Genuine cinematic colour made from over a billion shades, with certified 100% colour volume that does not fade over time. Dual LED technology uncovers bold contrst and accurate colour. Quantum Processor 4K uses AI to provide the very best picture and targeted sound based on what you are watching. Voice control is made possible via multiple voice assistants, all built-in. Boundless design and Ambient Mode+ ensure your TV looks perfect from any angle.</p> <p>Quantum Processor 4K uses AI to optimise the picture and sound quality based on what you are watching and when you are watching it, day and night. This includes AI upscaling of your Standard and High Definition content.</p> <p>Ambient Mode+ allows you to turn your TV screen into a decorative feature, displaying useful information, your own photos, or blend the TV into its surroundings. It automatically adjusts to the light in your room, so that you can easily make the big blank screen a thing of the past.</p>"
    }
]